app/controllers/homepage_controller.rb

SELECT `categories`.* FROM `categories`  WHERE `categories`.`parent_id` IN (37948, 37949, 37950, 37951) ORDER BY sort_priority
SELECT `custom_fields`.* FROM `custom_fields`  WHERE `custom_fields`.`community_id` = 6239
---
  def index
    @homepage = true

    @view_type = HomepageController.selected_view_type(params[:view], @current_community.default_browse_view, APP_DEFAULT_VIEW_TYPE, VIEW_TYPES)

    @categories = @current_community.categories.includes(:children)
    @main_categories = @categories.select { |c| c.parent_id == nil }

    all_shapes = shapes.get(community_id: @current_community.id)[:data]

    # This assumes that we don't never ever have communities with only 1 main share type and
    # only 1 sub share type, as that would make the listing type menu visible and it would look bit silly
    listing_shape_menu_enabled = all_shapes.size > 1
    @show_categories = @categories.size > 1
    show_price_filter = @current_community.show_price_filter && all_shapes.any? { |s| s[:price_enabled] }
    @show_custom_fields = @current_community.custom_fields.any?(&:can_filter?) || show_price_filter