app/controllers/listings_controller.rb

SELECT  `listing_images`.* FROM `listing_images`  WHERE `listing_images`.`listing_id` = 87777 LIMIT 1
---
  def show
    @selected_tribe_navi_tab = "home"

    @current_image = if params[:image]
      @listing.image_by_id(params[:image])
    else
      @listing.listing_images.first

SELECT  `listings`.* FROM `listings`  WHERE `listings`.`community_id` = 6239 AND `listings`.`id` = 87777 LIMIT 1
---
  def ensure_authorized_to_view
    # If listing is not found (in this community) the find method
    # will throw ActiveRecord::NotFound exception, which is handled
    # correctly in production environment (404 page)
    @listing = @current_community.listings.find(params[:id])