app/models/community.rb

  def self.find_by_identifier(identifiers)
    priority = [:id, :ident, :domain]

    identifier_to_use = priority.find { |identifier| identifiers[identifier].present? }
---
SELECT  `communities`.* FROM `communities`  WHERE `communities`.`domain` = 'localhost' LIMIT 1