app/views/layouts/_header_menu.haml


  - Maybe(@current_community).menu_links.each do |menu_links|
---
SELECT `menu_links`.* FROM `menu_links`  WHERE `menu_links`.`community_id` = 6239 ORDER BY sort_priority